app/views/listings/show.html.erb

SELECT locations.*, (69.09332411348201 * ABS(locations.latitude - 40.4842382) * 0.7071067811865475) + (59.836573914187355 * ABS(locations.longitude - -74.4427254) * 0.7071067811865475) AS distance, CASE WHEN (locations.latitude >= 40.4842382 AND locations.longitude >= -74.4427254) THEN 45.0 WHEN (locations.latitude < 40.4842382 AND locations.longitude >= -74.4427254) THEN 135.0 WHEN (locations.latitude < 40.4842382 AND locations.longitude < -74.4427254) THEN 225.0 WHEN (locations.latitude >= 40.4842382 AND locations.longitude < -74.4427254) THEN 315.0 END AS bearing FROM "locations" WHERE (locations.latitude BETWEEN 40.33950641688915 AND 40.62896998311085 AND locations.longitude BETWEEN -74.63301558427952 AND -74.25243521572048 AND locations.id != 1) ORDER BY distance ASC
---
<h3>Nearby Listings</h3>
<% @listing.location.nearbys(10).each do |location| %>