app/views/users/show.html.erb

SELECT "listings".* FROM "listings" WHERE "listings"."user_id" = 1
---
<h2>Listings Created</h2>
<% @user.listings.each do |listing| %>

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = 1
---
<h2>Fovorites Listings</h2>
<% @user.favorites.each do |favorite| %>