app/controllers/favorites_controller.rb

INSERT INTO "favorites" ("created_at", "listing_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Sun, 22 Sep 2013 05:37:29 UTC +00:00], ["listing_id", 0], ["updated_at", Sun, 22 Sep 2013 05:37:29 UTC +00:00], ["user_id", 0]]
---
  def create
    @favorite = Favorite.new(params[:favorite])
    if @favorite.save