app/controllers/listings_controller.rb

  def index
    if params[:search].present?
      @listings = Location.near(params[:search], 50, :order => :distance).map{ |loc| loc.listing }
---
SELECT "listings".* FROM "listings" WHERE "listings"."id" = 1 LIMIT 1
SELECT locations.*, (69.09332411348201 * ABS(locations.latitude - 40.4862157) * 0.7071067811865475) + (59.836573914187355 * ABS(locations.longitude - -74.4518188) * 0.7071067811865475) AS distance, CASE WHEN (locations.latitude >= 40.4862157 AND locations.longitude >= -74.4518188) THEN 45.0 WHEN (locations.latitude < 40.4862157 AND locations.longitude >= -74.4518188) THEN 135.0 WHEN (locations.latitude < 40.4862157 AND locations.longitude < -74.4518188) THEN 225.0 WHEN (locations.latitude >= 40.4862157 AND locations.longitude < -74.4518188) THEN 315.0 END AS bearing FROM "locations" WHERE (locations.latitude BETWEEN 39.76255678444576 AND 41.20987461555424 AND locations.longitude BETWEEN -75.40329775370148 AND -73.50033984629852) ORDER BY distance

  def create
    @user = current_user
    @listing = @user.listings.build(params[:listing])
    if @listing.save
---
INSERT INTO "listings" ("bathrooms", "bedrooms", "cooling_type", "created_at", "description", "home_sqr_foot", "lot_sqr_foot", "parking_type", "price", "res_type", "updated_at", "user_id", "year_built") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @listing = Listing.find(params[:id])
    @listing.destroy
---
SELECT "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "listings" WHERE "listings"."id" = ?  [["id", 1]]