app/controllers/users_controller.rb

  def show
    @user = User.select("id, email, last_sign_in_at, created_at").find(params[:id])
---
SELECT id, email, last_sign_in_at, created_at FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]